src/InformationRegisters/ar_Запуски.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ar_Запуски</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ar_Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ar_СтатусЗапуска</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ОтветLLM</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_АгентРеф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ar_Агенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_СтартовалВ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ЗавершенВ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_Триггер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ПользовательРеф</Name>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ТокеновВход</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ТокеновВыход</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_СтоимостьРуб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ШаговВсего</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_РодительскийRunId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_StateSnapshot</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_LastHeartbeat</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ПрофильЗапуска</Name>
					<Comment>Профиль запуска (CONS-01), определивший ответственного и область данных этого запуска. Пустая ссылка — профиль не указан (обратная совместимость, CONS-02).</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ar_ПрофилиЗапуска</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ПопытокВозобновления</Name>
					<Comment>Счётчик повторов техсбоя (§3.5) и предохранитель третьего слоя детекции прогресса — потолок 10 продолжений (§3.3, CONS-11). Заполняется ar_Планировщик.ОбработатьАвтовозобновление (CONS-09).</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ПродолженийСделано</Name>
					<Comment>CONS-11: счётчик фактических продолжений цикла по вердикту Продолжить надзора (§3.3) — предохранитель слоя 3, потолок 10. НЕ путать с ar_ПопытокВозобновления (CONS-09, счётчик техповторов, потолок 3) — разные счётчики по решению аналитика/оркестратора, во избежание рассинхрона двух независимых механизмов. Не сбрасывается при автовозобновлении техсбоя (ar_Планировщик.ОбработатьАвтовозобновление).</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ПоследнееРешениеНадзора</Name>
					<Comment>Каноническое имя значения ar_ВердиктНадзора (или пусто, если надзор ещё не вызывался) — хранится строкой, а не ссылкой на перечисление, чтобы консоль показывала решение без join (план §5.1). Заполняется ar_Надзор (CONS-10).</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ОтпечатокШага</Name>
					<Comment>Хэш «имя tool + хэш аргументов + хэш результата» последнего шага — основа result-aware детекции застревания (§3.3, CONS-11). 64 символа — под hex SHA-256.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ПовторитьПосле</Name>
					<Comment>Момент следующей попытки при временном техсбое (сеть, таймаут, 429/5xx); пусто — повтор не запланирован (§3.5). Читает и пишет ar_Планировщик.ОбработатьАвтовозобновление (CONS-09).</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ТекущийЭтап</Name>
					<Comment>PLAN-01: название текущего этапа плана (заголовок пункта) — для быстрого отображения без join (план §5.1). Заполняется ar_RuntimeЦикл (PLAN-04) из ar_ПланЗапуска.ТекущийПункт (PLAN-02, пока не реализован). Полный план не хранится в регистре — восстанавливается из последнего события PlanUpdated в ar_СобытияЗапуска. Пусто для запусков без плана.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ЭтаповВсего</Name>
					<Comment>PLAN-01: общее количество этапов плана. Заполняется ar_RuntimeЦикл (PLAN-04) из ar_ПланЗапуска.Прогресс (PLAN-02, пока не реализован). 0 — план не объявлен или запуск без планирования. Миграция существующих записей не требуется.</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ЭтаповЗакрыто</Name>
					<Comment>PLAN-01: количество завершённых этапов плана. Заполняется ar_RuntimeЦикл (PLAN-04) из ar_ПланЗапуска.Прогресс (PLAN-02, пока не реализован). 0 — план не объявлен или запуск без планирования. Миграция существующих записей не требуется.</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ОжидаетСобытия</Name>
					<Comment>PLAN-10: JSON-строка вида {\"object_type\": \"Справочник.Контрагенты\", \"filter\": {\"Наименование\": \"ООО Ромашка\"}} - тип объекта + плоский фильтр без операторов, по аналогии с ar_ОбработчикПодписок.ГорячиеТипы/ПроверитьФильтр. Заполняется ar_RuntimeЦикл/ar_ИнструментыПлан при вызове tool wait_for_event(object_type, filter, deadline_hours) (PLAN-11, пока не реализован). Пусто, если запуск не в PausedForEvent. Миграция существующих записей не требуется.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ОжиданиеДо</Name>
					<Comment>PLAN-10: дедлайн ожидания события, DateTime (точность до секунды - deadline_hours в часах, PLAN-11). Заполняется ar_RuntimeЦикл при вызове tool wait_for_event как ТекущаяДата() + deadline_hours часов (PLAN-11, пока не реализован). Сравнивается с ТекущаяДата() в регламентном задании проверки дедлайна (PLAN-13). Пусто, если запуск не в PausedForEvent. Миграция существующих записей не требуется.</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ar_RunId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ar_СтатусЗапуска.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ar_СтатусЗапуска</Name>
			<Comment>Жизненный цикл запуска агента: created -&gt; running -&gt; paused/completed/failed/...</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Created</Name>
					<Comment>Запись создана, фоновое задание ещё не стартовало</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Running</Name>
					<Comment>Фоновое задание активно, loop работает</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PausedForApproval</Name>
					<Comment>Loop приостановлен, ждёт решения оператора в очереди подтверждений</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PausedForInput</Name>
					<Comment>Loop приостановлен, агент ожидает ответа оператора на вопрос ask_user</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Completed</Name>
					<Comment>Финальный статус: агент выполнил задачу без ошибок</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Failed</Name>
					<Comment>Финальный статус: необработанное исключение или сбой LLM</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Cancelled</Name>
					<Comment>Финальный статус: отменён пользователем вручную</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>MaxStepsReached</Name>
					<Comment>Финальный статус: превышен МаксШагов агента</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DeniedGlobally</Name>
					<Comment>Финальный статус: пользователь не входит в роль агента</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Interrupted</Name>
					<Comment>Финальный статус: heartbeat пропал дольше порога, сервер упал</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FailedIncompatibleState</Name>
					<Comment>Финальный статус: StateSnapshot несовместим с текущей версией ядра</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PausedForEvent</Name>
					<Comment>PLAN-10: Loop приостановлен, ждёт наступления внешнего события (tool wait_for_event, PLAN-11) или истечения дедлайна ar_ОжиданиеДо (PLAN-13). Снимается ar_ОбработчикПодписок (push, PLAN-12) или регламентным заданием проверки дедлайна (PLAN-13).</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/CommonModules/ar_AuditЗапуски/Ext/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, Александр Барабанов
//
// AgentRunner для 1С — свободное программное обеспечение: вы можете
// распространять и/или изменять его на условиях GNU Affero General Public
// License версии 3, опубликованной Free Software Foundation.
//
// Программа распространяется в надежде, что она будет полезной, но БЕЗ
// КАКИХ-ЛИБО ГАРАНТИЙ. Подробности — в файле LICENSE в корне репозитория
// и по ссылке: https://www.gnu.org/licenses/agpl-3.0.html
//
// Исходный код проекта:
// https://github.com/AI-1C-Expert/agentrunner
///////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////
// Общий модуль ar_AuditЗапуски (Аудит запусков агентов).
//
// Единственная точка записи жизненного цикла запуска агента в регистр сведений
// ar_Запуски. Запись должна выполняться независимо от прав пользователя сессии
// (Reader-роль не имеет права добавления записей) — привилегию поднимает
// вызывающий код точечно, не сам модуль.
//
// Свойства модуля: Сервер, Привилегированный = Ложь (AUD-06: платформа
// запрещает Privileged=true в общих модулях расширений - "Cannot use
// privileged common modules in extensions", проверено при загрузке .cfe в
// реальную ИБ). Привилегии поднимает вызывающий код точечно -
// УстановитьПривилегированныйРежим(Истина)/Попытка...Исключение...(Ложь)/
// КонецПопытки/(Ложь) - через фасад ar_AuditЗащищённыйРежим
// (ЗаписатьСтатусЗапускаПривилегированно, СоздатьЗапускПривилегированно,
// СохранитьСнимокПривилегированно) там, где он подключён, либо локально в
// вызывающем модуле (например Heartbeat в ar_RuntimeЦикл). Точки чтения
// (ПрочитатьСнимок) намеренно НЕ оборачиваются привилегиями - работают на
// правах Read, доступных всем операционным ролям. Ранее (AUD-01/AUD-04/AUD-05)
// привилегия выставлялась в манифесте - см. AUD-06 для истории смены механизма.
//
// Контракт API: см. AUD-01.md, META-14.md. Параметры — RunId (UUID-строка
// длиной 36) и СтруктураДанных с набором ключей, соответствующих ресурсам
// регистра ar_Запуски. Полный список — в спеке META-14.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Создать запись о запуске агента.
//
// Параметры:
//  RunId             - Строка - идентификатор запуска (UUID, длина 36). Обязателен.
//  СтруктураДанных   - Структура - данные запуска:
//                        * Статус           - ПеречислениеСсылка.ar_СтатусЗапуска
//                                              или Строка (имя значения перечисления). Обязателен.
//                        * АгентРеф         - СправочникСсылка.ar_Агенты. Опционально.
//                        * СтартовалВ       - Дата. По умолчанию ТекущаяДатаСеанса().
//                        * Триггер          - Строка (manual/cron/webhook/mention/approval_resume).
//                                              По умолчанию "manual".
//                        * ПользовательРеф  - СправочникСсылка.Пользователи. Опционально.
//                        * РодительскийRunId - Строка(36). Опционально.
//                        * ОтветLLM         - Строка. Опционально.
//                        * ПрофильЗапуска   - СправочникСсылка.ar_ПрофилиЗапуска. Опционально
//                                              (CONS-02); пустая ссылка/отсутствие ключа - профиль
//                                              не указан, поведение как до CONS-02.
//
// Возвращаемое значение: нет.
//
Процедура Создать(RunId, СтруктураДанных) Экспорт

	ПроверитьПараметры(RunId, СтруктураДанных);

	// Значения по умолчанию для создания.
	Если Не СтруктураДанных.Свойство("СтартовалВ") Или Не ЗначениеЗаполнено(СтруктураДанных.СтартовалВ) Тогда
		СтруктураДанных.Вставить("СтартовалВ", ТекущаяДатаСеанса());
	КонецЕсли;
	Если Не СтруктураДанных.Свойство("Триггер") Или ПустаяСтрока(СтруктураДанных.Триггер) Тогда
		СтруктураДанных.Вставить("Триггер", "manual");
	КонецЕсли;
	// LastHeartbeat = СтартовалВ, чтобы sweeper не поймал только что стартовавший запуск.
	Если Не СтруктураДанных.Свойство("LastHeartbeat") Тогда
		СтруктураДанных.Вставить("LastHeartbeat", СтруктураДанных.СтартовалВ);
	КонецЕсли;

	ЗаписатьЗапуск(RunId, СтруктураДанных);

КонецПроцедуры

// Завершить (обновить) запись о запуске агента.
//
// При отсутствии записи с указанным RunId создаёт новую — операция идемпотентна.
//
// Параметры:
//  RunId             - Строка - идентификатор запуска (UUID, длина 36). Обязателен.
//  СтруктураДанных   - Структура - данные запуска:
//                        * Статус           - ПеречислениеСсылка.ar_СтатусЗапуска или Строка. Обязателен.
//                        * ЗавершенВ        - Дата. По умолчанию ТекущаяДатаСеанса().
//                        * ОтветLLM         - Строка. Опционально.
//                        * ТокеновВход      - Число. Опционально.
//                        * ТокеновВыход     - Число. Опционально.
//                        * СтоимостьРуб     - Число. Опционально.
//                        * ШаговВсего       - Число. Опционально.
//                        * РодительскийRunId - Строка(36). Опционально.
//
// Возвращаемое значение: нет.
//
Процедура Завершить(RunId, СтруктураДанных) Экспорт

	ПроверитьПараметры(RunId, СтруктураДанных);

	Если Не СтруктураДанных.Свойство("ЗавершенВ") Или Не ЗначениеЗаполнено(СтруктураДанных.ЗавершенВ) Тогда
		СтруктураДанных.Вставить("ЗавершенВ", ТекущаяДатаСеанса());
	КонецЕсли;

	ЗаписатьЗапуск(RunId, СтруктураДанных);

КонецПроцедуры

// Обновить отметку ar_LastHeartbeat для запуска. Вызывается после каждого
// шага цикла рассуждения (RT-06/RT-07).
//
// При отсутствии записи с указанным RunId — молча фиксирует событие в журнале
// регистрации без выброса исключения (см. граничные случаи в META-14).
//
// Параметры:
//  RunId - Строка - идентификатор запуска. Обязателен.
//
Процедура Heartbeat(RunId) Экспорт

	ПроверитьRunId(RunId);

	ЗаписьНайдена = Ложь;

	НачатьТранзакцию();
	Попытка

		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ar_Запуски");
		ЭлементБлокировки.УстановитьЗначение("ar_RunId", RunId);
		Блокировка.Заблокировать();

		МенеджерЗаписи = РегистрыСведений.ar_Запуски.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ar_RunId = RunId;
		МенеджерЗаписи.Прочитать();

		Если МенеджерЗаписи.Выбран() Тогда
			ЗаписьНайдена = Истина;
			МенеджерЗаписи.ar_LastHeartbeat = ТекущаяДатаСеанса();
			МенеджерЗаписи.Записать(Истина);
		КонецЕсли;

		ЗафиксироватьТранзакцию();

	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

	// Запись не найдена — пишем предупреждение в журнал и выходим без исключения,
	// чтобы не прерывать цикл рассуждения (см. граничные случаи META-14).
	// Логирование вынесено за пределы транзакции (std783, std498).
	Если Не ЗаписьНайдена Тогда
		ТекстПредупреждения = СтрШаблон(
			НСтр("ru = 'Heartbeat для несуществующего RunId: %1';
				|en = 'Heartbeat for missing RunId: %1'"),
			RunId);
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'ar_AuditЗапуски.Heartbeat'; en = 'ar_AuditЗапуски.Heartbeat'"),
			УровеньЖурналаРегистрации.Предупреждение,
			Метаданные.РегистрыСведений.ar_Запуски,
			,
			ТекстПредупреждения);
	КонецЕсли;

КонецПроцедуры

// Прервать запуск — установить Статус = Interrupted и ЗавершенВ = ТекущаяДатаСеанса().
// Используется регламентным заданием ar_ОчисткаЗависших (SCHED-04) и ручной
// командой UI.
//
// Защита от гонки: если запуск уже в финальном статусе (Completed, Failed,
// Cancelled, Interrupted, FailedIncompatibleState) — данные не перезаписываются,
// в журнал пишется Предупреждение. Это предотвращает перезатирание корректно
// завершившегося запуска отметкой Interrupted при одновременном тике sweeper-а
// и нормальном завершении фонового задания (SCHED-04, UC-3).
//
// Параметры:
//  RunId - Строка - идентификатор запуска. Обязателен.
//
Процедура ПрерватьЗапуск(RunId) Экспорт

	ПроверитьRunId(RunId);

	// Статус-флаг для логирования за пределами транзакции (std783, std498):
	//   "final"   - запуск уже в финальном статусе, отметка не применена;
	//   "missing" - записи запуска нет, отметка не применена;
	//   ""        - отметка Interrupted применена штатно.
	ИтогОперации = "";

	НачатьТранзакцию();
	Попытка

		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ar_Запуски");
		ЭлементБлокировки.УстановитьЗначение("ar_RunId", RunId);
		Блокировка.Заблокировать();

		МенеджерЗаписи = РегистрыСведений.ar_Запуски.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ar_RunId = RunId;
		МенеджерЗаписи.Прочитать();

		Если Не МенеджерЗаписи.Выбран() Тогда
			// Записи запуска нет — фантомную запись Interrupted не создаём.
			ИтогОперации = "missing";
		ИначеЕсли ЭтоФинальныйСтатус(МенеджерЗаписи.ar_Статус) Тогда
			ИтогОперации = "final";
		Иначе
			МенеджерЗаписи.ar_Статус = Перечисления.ar_СтатусЗапуска.Interrupted;
			МенеджерЗаписи.ar_ЗавершенВ = ТекущаяДатаСеанса();
			МенеджерЗаписи.Записать(Истина);
		КонецЕсли;

		ЗафиксироватьТранзакцию();

	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

	// Логирование вынесено за пределы транзакции (std783, std498).
	Если ИтогОперации = "final" Тогда
		ТекстПредупреждения = СтрШаблон(
			НСтр("ru = 'Прервать: запуск %1 уже в финальном статусе, отметка Interrupted не применяется';
				|en = 'Abort: run %1 already in a final status, Interrupted mark skipped'"),
			RunId);
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'ar_AuditЗапуски.ПрерватьЗапуск'; en = 'ar_AuditЗапуски.Abort'"),
			УровеньЖурналаРегистрации.Предупреждение,
			Метаданные.РегистрыСведений.ar_Запуски,
			,
			ТекстПредупреждения);
	ИначеЕсли ИтогОперации = "missing" Тогда
		ТекстПредупреждения = СтрШаблон(
			НСтр("ru = 'Прервать: запись запуска %1 не найдена, отметка Interrupted не применяется';
				|en = 'Abort: run record %1 not found, Interrupted mark skipped'"),
			RunId);
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'ar_AuditЗапуски.ПрерватьЗапуск'; en = 'ar_AuditЗапуски.Abort'"),
			УровеньЖурналаРегистрации.Предупреждение,
			Метаданные.РегистрыСведений.ar_Запуски,
			,
			ТекстПредупреждения);
	КонецЕсли;

КонецПроцедуры

// Найти зависшие запуски: статус в (Running, PausedForApproval) и
// ar_LastHeartbeat старше СВОЕЙ для каждого статуса границы. Используется
// регламентным заданием ar_ОчисткаЗависших (SCHED-04). Возвращает не более 50
// записей, упорядоченных по давности heartbeat (FIFO).
//
// ДВЕ ГРАНИЦЫ, А НЕ ОДНА: молчание в этих статусах означает разное. Running -
// работает фоновое задание, и отсутствие heartbeat дольше порога это признак
// зависания. PausedForApproval - задание завершилось штатно и ждёт человека,
// обновлять heartbeat некому по определению. С общей границей sweeper убивал
// запуск через 90 секунд после постановки в очередь: оператор ещё читал
// карточку подтверждения, а run уже был Interrupted, и approval навсегда
// оставался pending.
//
// AUD-06: модуль Privileged=false (платформенное ограничение для расширений),
// поэтому запрос выполняется под привилегиями, поднятыми вызывающим фасадом
// ar_AuditЗащищённыйРежим.НайтиЗависшиеЗапускиПривилегированно (эта функция
// сама привилегий не поднимает - суффикс "БезПривилегий" в имени).
//
// Параметры:
//  ГраницаHeartbeat - Дата - запуски Running с ar_LastHeartbeat строго раньше
//                     этой границы считаются зависшими.
//  ГраницаApproval  - Дата - то же для PausedForApproval. Необязательный: если
//                     не передан, используется ГраницаHeartbeat (поведение до
//                     разделения порогов).
//
// Возвращаемое значение:
//  Массив - элементы типа Строка (ar_RunId). Пустой, если зависших нет.
//
Функция НайтиЗависшиеЗапускиБезПривилегий(Знач ГраницаHeartbeat,
	Знач ГраницаApproval = Неопределено) Экспорт

	Результат = Новый Массив;

	Если ГраницаApproval = Неопределено Тогда
		ГраницаApproval = ГраницаHeartbeat;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 50
		|	Запуски.ar_RunId КАК RunId
		|ИЗ
		|	РегистрСведений.ar_Запуски КАК Запуски
		|ГДЕ
		|	(Запуски.ar_Статус = &СтатусRunning
		|			И Запуски.ar_LastHeartbeat < &ГраницаHeartbeat)
		|		ИЛИ (Запуски.ar_Статус = &СтатусPausedForApproval
		|			И Запуски.ar_LastHeartbeat < &ГраницаApproval)
		|УПОРЯДОЧИТЬ ПО
		|	Запуски.ar_LastHeartbeat";
	Запрос.УстановитьПараметр("СтатусRunning", Перечисления.ar_СтатусЗапуска.Running);
	Запрос.УстановитьПараметр("СтатусPausedForApproval",
		Перечисления.ar_СтатусЗапуска.PausedForApproval);
	Запрос.УстановитьПараметр("ГраницаHeartbeat", ГраницаHeartbeat);
	Запрос.УстановитьПараметр("ГраницаApproval", ГраницаApproval);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(СокрЛП(Выборка.RunId));
	КонецЦикла;

	Возврат Результат;

КонецФункции

// CONS-09, блок 1: найти кандидатов рестарта умершего процесса - запуски
// Interrupted с валидным (непустым) StateSnapshot.
//
// Ограничители безопасности (риск массового рестарта старых записей после
// первого включения задания на базе с историческими данными):
//  * ПЕРВЫЕ 50 - единичный тик не может захватить весь бэклог;
//  * ar_ЗавершенВ >= ГраницаДревности - не трогать запуски, прерванные до
//    появления этой логики (по умолчанию граница = 7 дней назад, см.
//    ar_Scheduler.ОбработатьАвтовозобновление) - старые Interrupted это
//    известное состояние SCHED-04, ожидающее ручного Resume, а не техсбой,
//    который стоит рестартовать автоматически без участия человека;
//  * ar_ПовторитьПосле НЕ заполнено ИЛИ уже в прошлом - запись, у которой
//    отдельно запланирован retry блоком 2 (см. НайтиКандидатовРетраяБезПривилегий),
//    в принципе не может иметь статус Interrupted одновременно (Interrupted и
//    Failed - взаимоисключающие значения одного перечисления), условие
//    добавлено защитно на случай будущих изменений схемы статусов.
//
// AUD-06: вызывается под привилегиями, поднятыми фасадом
// ar_AuditЗащищённыйРежим.НайтиКандидатовРестартаПривилегированно.
//
// Параметры:
//  ГраницаДревности - Дата - не рассматривать запуски с ar_ЗавершенВ раньше
//                     этой границы.
//
// Возвращаемое значение:
//  Массив - элементы типа Строка (ar_RunId). Пустой, если кандидатов нет.
//
Функция НайтиКандидатовРестартаБезПривилегий(Знач ГраницаДревности) Экспорт

	Результат = Новый Массив;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 50
		|	Запуски.ar_RunId КАК RunId
		|ИЗ
		|	РегистрСведений.ar_Запуски КАК Запуски
		|ГДЕ
		|	Запуски.ar_Статус = &СтатусInterrupted
		|	И Запуски.ar_StateSnapshot ЕСТЬ НЕ NULL
		|	И Запуски.ar_ЗавершенВ >= &ГраницаДревности
		|УПОРЯДОЧИТЬ ПО
		|	Запуски.ar_ЗавершенВ";
	Запрос.УстановитьПараметр("СтатусInterrupted", Перечисления.ar_СтатусЗапуска.Interrupted);
	Запрос.УстановитьПараметр("ГраницаДревности", ГраницаДревности);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(СокрЛП(Выборка.RunId));
	КонецЦикла;

	Возврат Результат;

КонецФункции

// CONS-09, блок 2: найти кандидатов повтора техсбоя - запуски Failed с уже
// наступившим ar_ПовторитьПосле и не исчерпанным лимитом попыток.
//
// Ограничители безопасности:
//  * ПЕРВЫЕ 50;
//  * ar_ПовторитьПосле ЗАПОЛНЕНО И <= ТекущийМомент - запись без запланированного
//    retry (пустая дата, подавляющее большинство исторических Failed-записей
//    базы, созданных до появления этой логики) никогда не попадёт в выборку -
//    ar_ПовторитьПосле по умолчанию пусто и остаётся пустым, пока
//    ar_RuntimeЦикл сам не проставит его при новом транзиентном сбое;
//  * ar_ПопытокВозобновления < 3 - защитный дубль на случай гонки/бага (после
//    3-й неудачной попытки ar_RuntimeЦикл вообще не проставляет
//    ar_ПовторитьПосле, но фильтр по счётчику не полагается только на это).
//
// AUD-06: вызывается под привилегиями, поднятыми фасадом
// ar_AuditЗащищённыйРежим.НайтиКандидатовРетраяПривилегированно.
//
// Параметры:
//  ТекущийМомент - Дата - момент сравнения с ar_ПовторитьПосле (обычно
//                  ТекущаяДатаСеанса() вызывающей стороны).
//
// Возвращаемое значение:
//  Массив - элементы типа Строка (ar_RunId). Пустой, если кандидатов нет.
//
Функция НайтиКандидатовРетраяБезПривилегий(Знач ТекущийМомент) Экспорт

	Результат = Новый Массив;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 50
		|	Запуски.ar_RunId КАК RunId
		|ИЗ
		|	РегистрСведений.ar_Запуски КАК Запуски
		|ГДЕ
		|	Запуски.ar_Статус = &СтатусFailed
		|	И Запуски.ar_ПовторитьПосле <> &ПустаяДата
		|	И Запуски.ar_ПовторитьПосле <= &ТекущийМомент
		|	И Запуски.ar_ПопытокВозобновления < 3
		|УПОРЯДОЧИТЬ ПО
		|	Запуски.ar_ПовторитьПосле";
	Запрос.УстановитьПараметр("СтатусFailed", Перечисления.ar_СтатусЗапуска.Failed);
	Запрос.УстановитьПараметр("ПустаяДата", Дата(1, 1, 1));
	Запрос.УстановитьПараметр("ТекущийМомент", ТекущийМомент);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(СокрЛП(Выборка.RunId));
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Подсчитать активные (Running) запуски для rate-limiter планировщика (SCHED-05):
// число активных запусков конкретного агента и суммарное число активных запусков.
// Учитывается только статус Running — фоновое задание агента выполняется лишь в нём
// (PausedForApproval — задание уже завершено, слот свободен; Created — переходный миг).
//
// AUD-06: модуль Privileged=false (платформенное ограничение для расширений),
// поэтому запрос выполняется под привилегиями, поднятыми вызывающим фасадом
// ar_AuditЗащищённыйРежим.ПодсчитатьАктивныеЗапускиПривилегированно (эта функция
// сама привилегий не поднимает - суффикс "БезПривилегий" в имени).
//
// Параметры:
//  СсылкаАгент - СправочникСсылка.ar_Агенты - агент для per-agent подсчёта.
//
// Возвращаемое значение:
//  Структура - ровно два числовых ключа:
//    * ПоАгенту      - Число - активных Running-запусков с ar_АгентРеф = СсылкаАгент.
//    * ВсегоАктивных - Число - всех активных Running-запусков (без фильтра по агенту).
//
Функция ПодсчитатьАктивныеЗапускиБезПривилегий(Знач СсылкаАгент) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(*) КАК ВсегоАктивных,
		|	ЕСТЬNULL(СУММА(ВЫБОР КОГДА Запуски.ar_АгентРеф = &Агент ТОГДА 1 ИНАЧЕ 0 КОНЕЦ), 0) КАК ПоАгенту
		|ИЗ
		|	РегистрСведений.ar_Запуски КАК Запуски
		|ГДЕ
		|	Запуски.ar_Статус = &СтатусRunning";
	Запрос.УстановитьПараметр("Агент", СсылкаАгент);
	Запрос.УстановитьПараметр("СтатусRunning", Перечисления.ar_СтатусЗапуска.Running);

	Выборка = Запрос.Выполнить().Выбрать();

	ВсегоАктивных = 0;
	ПоАгенту = 0;
	Если Выборка.Следующий() Тогда
		// При нуле записей агрегаты КОЛИЧЕСТВО(*) = 0, а СУММА(...) = NULL.
		// NULL из запроса - это ТИП NULL, а не Неопределено: проверка
		// "= Неопределено" его НЕ ловит, и в ПоАгенту попадал NULL, из-за чего
		// сравнение "Счётчики.ПоАгенту >= ЛимитАгента" в ar_Scheduler падало с
		// "Greater than/Less than compare operations allowed only for values of
		// similar primitive types" на каждом тике планировщика. Снято ЕСТЬNULL
		// в самом запросе (выше) + страховка по типу здесь.
		ВсегоАктивных = ?(ТипЗнч(Выборка.ВсегоАктивных) = Тип("Число"), Выборка.ВсегоАктивных, 0);
		ПоАгенту = ?(ТипЗнч(Выборка.ПоАгенту) = Тип("Число"), Выборка.ПоАгенту, 0);
	КонецЕсли;

	Результат = Новый Структура;
	Результат.Вставить("ПоАгенту", ПоАгенту);
	Результат.Вставить("ВсегоАктивных", ВсегоАктивных);
	Возврат Результат;

КонецФункции

// Сохранить снимок состояния цикла рассуждения для последующего возобновления
// после approval-паузы.
//
// Параметры:
//  RunId           - Строка - идентификатор запуска. Обязателен.
//  ДанныеСостояния - Структура, Соответствие, Массив или примитив — содержимое state.
//                    Должно состоять только из сериализуемых типов (без HTTPСоединение,
//                    потоков, объектов форм, ЗаписьJSON/ЧтениеJSON). Ссылки на объекты
//                    ИБ передавать как НавигационнаяСсылка (строка).
//
Процедура СохранитьСнимок(RunId, ДанныеСостояния) Экспорт

	ПроверитьRunId(RunId);
	ПроверитьСериализуемость(ДанныеСостояния);

	Снимок = Новый Соответствие;
	Снимок.Вставить("v", 1);
	Снимок.Вставить("state", ДанныеСостояния);

	Хранилище = Новый ХранилищеЗначения(Снимок, Новый СжатиеДанных(9));

	НачатьТранзакцию();
	Попытка

		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ar_Запуски");
		ЭлементБлокировки.УстановитьЗначение("ar_RunId", RunId);
		Блокировка.Заблокировать();

		МенеджерЗаписи = РегистрыСведений.ar_Запуски.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ar_RunId = RunId;
		МенеджерЗаписи.Прочитать();

		Если Не МенеджерЗаписи.Выбран() Тогда
			МенеджерЗаписи.ar_RunId = RunId;
		КонецЕсли;

		МенеджерЗаписи.ar_StateSnapshot = Хранилище;
		МенеджерЗаписи.Записать(Истина);

		ЗафиксироватьТранзакцию();

	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

КонецПроцедуры

// Прочитать текущее значение счётчика повторов техсбоя (CONS-09) для RunId.
// Используется ar_RuntimeЦикл в момент падения LLM-вызова, чтобы посчитать
// номер попытки, которую предстоит запланировать (пауза 1/5/15 минут).
//
// Параметры:
//  RunId - Строка - идентификатор запуска. Обязателен.
//
// Возвращаемое значение:
//  Число - текущее значение ar_ПопытокВозобновления; 0, если запись не найдена.
//
Функция ПрочитатьПопытокВозобновления(RunId) Экспорт

	ПроверитьRunId(RunId);

	МенеджерЗаписи = РегистрыСведений.ar_Запуски.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ar_RunId = RunId;
	МенеджерЗаписи.Прочитать();

	Если Не МенеджерЗаписи.Выбран() Тогда
		Возврат 0;
	КонецЕсли;

	Возврат МенеджерЗаписи.ar_ПопытокВозобновления;

КонецФункции

// Прочитать снимок состояния цикла рассуждения.
//
// Параметры:
//  RunId - Строка - идентификатор запуска. Обязателен.
//
// Возвращаемое значение:
//  Структура - {v: Число, state: Произвольный} если снимок есть и формат совместим;
//  Неопределено - если запись не найдена, снимок пуст, или версия формата несовместима.
//
//  При несовместимой версии — пишет событие "incompatible_snapshot" в журнал
//  регистрации (вызывающий код должен установить статус FailedIncompatibleState).
//
Функция ПрочитатьСнимок(RunId) Экспорт

	ПроверитьRunId(RunId);

	МенеджерЗаписи = РегистрыСведений.ar_Запуски.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ar_RunId = RunId;
	МенеджерЗаписи.Прочитать();

	Если Не МенеджерЗаписи.Выбран() Тогда
		Возврат Неопределено;
	КонецЕсли;

	Хранилище = МенеджерЗаписи.ar_StateSnapshot;
	Если Хранилище = Неопределено Или ТипЗнч(Хранилище) <> Тип("ХранилищеЗначения") Тогда
		Возврат Неопределено;
	КонецЕсли;

	Снимок = Хранилище.Получить();
	Если Снимок = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	Версия = Неопределено;
	Состояние = Неопределено;
	РазобратьСнимок(Снимок, Версия, Состояние);

	// Версионирование: если версия снимка не совпадает с текущей версией формата
	// ядра — делегируем мигратору (RT-09). Мигратор либо апгрейдит снимок до
	// текущей версии, либо отказывает (снимок новее ядра / неизвестный формат).
	Если Версия <> ar_SnapshotМигратор.ТекущаяВерсия() Тогда
		РезМиграции = ar_SnapshotМигратор.Мигрировать(Снимок, Версия);
		Если Не РезМиграции.Успех Тогда
			ШаблонСобытия = НСтр("ru = 'incompatible_snapshot: RunId=%1, версия=%2, причина=%3';
				|en = 'incompatible_snapshot: RunId=%1, version=%2, reason=%3'");
			ТекстСобытия = СтрШаблон(ШаблонСобытия, RunId, Строка(Версия), РезМиграции.Причина);
			ЗаписьЖурналаРегистрации(
				НСтр("ru = 'ar_AuditЗапуски.ПрочитатьСнимок'; en = 'ar_AuditЗапуски.ReadSnapshot'"),
				УровеньЖурналаРегистрации.Ошибка,
				Метаданные.РегистрыСведений.ar_Запуски,
				,
				ТекстСобытия);
			Возврат Неопределено;
		КонецЕсли;

		// Перечитать v/state из мигрированного снимка (тип может быть Структура
		// или Соответствие — мигратор возвращает то, что вернул шаг миграции).
		Снимок = РезМиграции.Снимок;
		Версия = Неопределено;
		Состояние = Неопределено;
		РазобратьСнимок(Снимок, Версия, Состояние);
	КонецЕсли;

	Результат = Новый Структура;
	Результат.Вставить("v", Версия);
	Результат.Вставить("state", Состояние);
	Возврат Результат;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Истина, если статус является финальным — повторный перевод в Interrupted/иной
// финальный статус не выполняется (SCHED-04, UC-3). Финальные статусы:
// Completed, Failed, Cancelled, Interrupted, FailedIncompatibleState.
//
// Параметры:
//  Статус - ПеречислениеСсылка.ar_СтатусЗапуска - проверяемый статус.
//
// Возвращаемое значение:
//  Булево - Истина, если статус финальный.
//
Функция ЭтоФинальныйСтатус(Знач Статус)

	ФинальныеСтатусы = Новый Массив;
	ФинальныеСтатусы.Добавить(Перечисления.ar_СтатусЗапуска.Completed);
	ФинальныеСтатусы.Добавить(Перечисления.ar_СтатусЗапуска.Failed);
	ФинальныеСтатусы.Добавить(Перечисления.ar_СтатусЗапуска.Cancelled);
	ФинальныеСтатусы.Добавить(Перечисления.ar_СтатусЗапуска.Interrupted);
	ФинальныеСтатусы.Добавить(Перечисления.ar_СтатусЗапуска.FailedIncompatibleState);

	Возврат ФинальныеСтатусы.Найти(Статус) <> Неопределено;

КонецФункции

// Извлечь поля v и state из снимка независимо от его типа (Структура или
// Соответствие). Для нестандартных типов оба выходных параметра остаются
// Неопределено.
//
// Параметры:
//  Снимок     - Структура, Соответствие, Произвольный - прочитанный снимок.
//  Версия     - Произвольный - выходной: значение поля "v" (или Неопределено).
//  Состояние  - Произвольный - выходной: значение поля "state" (или Неопределено).
//
Процедура РазобратьСнимок(Снимок, Версия, Состояние)

	Если ТипЗнч(Снимок) = Тип("Соответствие") Тогда
		Версия = Снимок.Получить("v");
		Состояние = Снимок.Получить("state");
	ИначеЕсли ТипЗнч(Снимок) = Тип("Структура") Тогда
		Снимок.Свойство("v", Версия);
		Снимок.Свойство("state", Состояние);
	Иначе
		// Нестандартный тип снимка: v и state остаются Неопределено,
		// что приведёт к отказу совместимости в вызывающем коде.
		Версия = Неопределено;
		Состояние = Неопределено;
	КонецЕсли;

КонецПроцедуры

// Проверить корректность входных параметров. При нарушении контракта выбрасывает
// исключение с локализованным текстом.
//
Процедура ПроверитьПараметры(RunId, СтруктураДанных)

	ПроверитьRunId(RunId);

	Если ТипЗнч(СтруктураДанных) <> Тип("Структура") Тогда
		ВызватьИсключение НСтр("ru = 'ar_AuditЗапуски: СтруктураДанных должна быть типа Структура';
								|en = 'ar_AuditЗапуски: СтруктураДанных must be of type Structure'");
	КонецЕсли;

	Если Не СтруктураДанных.Свойство("Статус") Или Не ЗначениеЗаполнено(СтруктураДанных.Статус) Тогда
		ВызватьИсключение НСтр("ru = 'ar_AuditЗапуски: Статус обязателен';
								|en = 'ar_AuditЗапуски: Status is required'");
	КонецЕсли;

КонецПроцедуры

// Проверка RunId.
//
Процедура ПроверитьRunId(RunId)

	Если ТипЗнч(RunId) <> Тип("Строка") Или ПустаяСтрока(RunId) Тогда
		ВызватьИсключение НСтр("ru = 'ar_AuditЗапуски: RunId не может быть пустым';
								|en = 'ar_AuditЗапуски: RunId cannot be empty'");
	КонецЕсли;

КонецПроцедуры

// Преобразовать статус (Строка или ПеречислениеСсылка) в ссылку на перечисление
// ar_СтатусЗапуска. Обеспечивает обратную совместимость с прото-кодом, который
// передавал статус строкой ("running", "completed" и т. д.).
//
Функция СтатусСсылкой(Знач Статус)

	Если ТипЗнч(Статус) = Тип("ПеречислениеСсылка.ar_СтатусЗапуска") Тогда
		Возврат Статус;
	КонецЕсли;

	Если ТипЗнч(Статус) = Тип("Строка") Тогда
		// Маппинг прото-имён на канонические значения перечисления (META-08).
		Соответствие = СоответствиеСтрокаНаПеречисление();
		Каноническое = Соответствие.Получить(НРег(Статус));
		Если Каноническое <> Неопределено Тогда
			Возврат Перечисления.ar_СтатусЗапуска[Каноническое];
		КонецЕсли;

		// Прямой доступ по имени значения перечисления (для совместимости).
		Попытка
			Возврат Перечисления.ar_СтатусЗапуска[Статус];
		Исключение
			ВызватьИсключение СтрШаблон(
				НСтр("ru = 'ar_AuditЗапуски: неизвестный Статус ""%1""';
					|en = 'ar_AuditЗапуски: unknown Status ""%1""'"),
				Статус);
		КонецПопытки;
	КонецЕсли;

	ВызватьИсключение НСтр("ru = 'ar_AuditЗапуски: Статус должен быть ПеречислениеСсылка.ar_СтатусЗапуска или Строка';
							|en = 'ar_AuditЗапуски: Status must be EnumRef.ar_СтатусЗапуска or String'");

КонецФункции

// Маппинг прото-имён статусов (строки) на значения перечисления ar_СтатусЗапуска.
//
Функция СоответствиеСтрокаНаПеречисление()

	Соответствие = Новый Соответствие;
	Соответствие.Вставить("created", "Created");
	Соответствие.Вставить("running", "Running");
	Соответствие.Вставить("pausedforapproval", "PausedForApproval");
	Соответствие.Вставить("completed", "Completed");
	Соответствие.Вставить("failed", "Failed");
	Соответствие.Вставить("cancelled", "Cancelled");
	Соответствие.Вставить("maxstepsreached", "MaxStepsReached");
	Соответствие.Вставить("deniedglobally", "DeniedGlobally");
	Соответствие.Вставить("interrupted", "Interrupted");
	Соответствие.Вставить("failedincompatiblestate", "FailedIncompatibleState");
	Возврат Соответствие;

КонецФункции

// Записать данные запуска в регистр ar_Запуски через менеджер записи.
// Менеджер записи перезаписывает существующую запись с тем же ключом —
// поведение идемпотентно для Создать/Завершить.
//
Процедура ЗаписатьЗапуск(RunId, СтруктураДанных)

	НачатьТранзакцию();
	Попытка

		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ar_Запуски");
		ЭлементБлокировки.УстановитьЗначение("ar_RunId", RunId);
		Блокировка.Заблокировать();

		МенеджерЗаписи = РегистрыСведений.ar_Запуски.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ar_RunId = RunId;
		МенеджерЗаписи.Прочитать();
		Если Не МенеджерЗаписи.Выбран() Тогда
			МенеджерЗаписи.ar_RunId = RunId;
		КонецЕсли;

		Если СтруктураДанных.Свойство("Статус") И ЗначениеЗаполнено(СтруктураДанных.Статус) Тогда
			МенеджерЗаписи.ar_Статус = СтатусСсылкой(СтруктураДанных.Статус);
		КонецЕсли;

		ПрисвоитьЕслиЕсть(МенеджерЗаписи, "ar_ОтветLLM",         СтруктураДанных, "ОтветLLM");
		ПрисвоитьЕслиЕсть(МенеджерЗаписи, "ar_АгентРеф",          СтруктураДанных, "АгентРеф");
		ПрисвоитьЕслиЕсть(МенеджерЗаписи, "ar_СтартовалВ",        СтруктураДанных, "СтартовалВ");
		ПрисвоитьЕслиЕсть(МенеджерЗаписи, "ar_ЗавершенВ",         СтруктураДанных, "ЗавершенВ");
		ПрисвоитьЕслиЕсть(МенеджерЗаписи, "ar_Триггер",           СтруктураДанных, "Триггер");
		ПрисвоитьЕслиЕсть(МенеджерЗаписи, "ar_ПользовательРеф",   СтруктураДанных, "ПользовательРеф");
		ПрисвоитьЕслиЕсть(МенеджерЗаписи, "ar_ТокеновВход",       СтруктураДанных, "ТокеновВход");
		ПрисвоитьЕслиЕсть(МенеджерЗаписи, "ar_ТокеновВыход",      СтруктураДанных, "ТокеновВыход");
		ПрисвоитьЕслиЕсть(МенеджерЗаписи, "ar_СтоимостьРуб",      СтруктураДанных, "СтоимостьРуб");
		ПрисвоитьЕслиЕсть(МенеджерЗаписи, "ar_ШаговВсего",        СтруктураДанных, "ШаговВсего");
		ПрисвоитьЕслиЕсть(МенеджерЗаписи, "ar_РодительскийRunId", СтруктураДанных, "РодительскийRunId");
		ПрисвоитьЕслиЕсть(МенеджерЗаписи, "ar_LastHeartbeat",     СтруктураДанных, "LastHeartbeat");
		// CONS-02: профиль запуска - опционален, пустая ссылка/отсутствие ключа
		// не меняет запись (обратная совместимость, решение 22).
		ПрисвоитьЕслиЕсть(МенеджерЗаписи, "ar_ПрофильЗапуска",    СтруктураДанных, "ПрофильЗапуска");
		// CONS-09: планирование/сброс техповтора. ПовторитьПосле передаётся явно
		// как Дата() (пустая) для очистки признака ожидания - ПрисвоитьЕслиЕсть
		// пропускает только Неопределено, поэтому очистка проходит нормально.
		ПрисвоитьЕслиЕсть(МенеджерЗаписи, "ar_ПовторитьПосле",       СтруктураДанных, "ПовторитьПосле");
		ПрисвоитьЕслиЕсть(МенеджерЗаписи, "ar_ПопытокВозобновления", СтруктураДанных, "ПопытокВозобновления");
		// CONS-10: вердикт надзора о достижении цели ("ЦельДостигнута"/
		// "Продолжить"/"Эскалировать") - строкой, совпадающей с именем значения
		// ar_ВердиктНадзора. ПрисвоитьЕслиЕсть пропускает ключ, если надзор
		// не вызывался (Failed/PausedForApproval/... - см. ar_Надзор).
		ПрисвоитьЕслиЕсть(МенеджерЗаписи, "ar_ПоследнееРешениеНадзора", СтруктураДанных, "ПоследнееРешениеНадзора");

		МенеджерЗаписи.Записать(Истина);

		ЗафиксироватьТранзакцию();

	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

КонецПроцедуры

// Присвоить значение реквизита менеджера записи, если ключ есть в структуре
// и значение не Неопределено.
//
Процедура ПрисвоитьЕслиЕсть(МенеджерЗаписи, ИмяРеквизита, СтруктураДанных, КлючСтруктуры)

	Если СтруктураДанных.Свойство(КлючСтруктуры) И СтруктураДанных[КлючСтруктуры] <> Неопределено Тогда
		МенеджерЗаписи[ИмяРеквизита] = СтруктураДанных[КлючСтруктуры];
	КонецЕсли;

КонецПроцедуры

// Проверка типов содержимого state перед сериализацией в ХранилищеЗначения.
// Допустимы: Структура, Соответствие, Массив, ФиксированноеСоответствие,
// ФиксированнаяСтруктура, ФиксированныйМассив, примитивы (Строка, Число,
// Булево, Дата, Неопределено, УникальныйИдентификатор). Ссылки на объекты
// ИБ ожидаются строками (НавигационнаяСсылка).
//
Процедура ПроверитьСериализуемость(Знач Значение)

	Если Значение = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ТипЗначения = ТипЗнч(Значение);
	ДопустимыеПримитивы = Новый Массив;
	ДопустимыеПримитивы.Добавить(Тип("Строка"));
	ДопустимыеПримитивы.Добавить(Тип("Число"));
	ДопустимыеПримитивы.Добавить(Тип("Булево"));
	ДопустимыеПримитивы.Добавить(Тип("Дата"));
	ДопустимыеПримитивы.Добавить(Тип("УникальныйИдентификатор"));

	Если ДопустимыеПримитивы.Найти(ТипЗначения) <> Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ТипЗначения = Тип("Структура") Или ТипЗначения = Тип("ФиксированнаяСтруктура") Тогда
		Для Каждого КлючЗначение Из Значение Цикл
			ПроверитьСериализуемость(КлючЗначение.Значение);
		КонецЦикла;
		Возврат;
	КонецЕсли;

	Если ТипЗначения = Тип("Соответствие") Или ТипЗначения = Тип("ФиксированноеСоответствие") Тогда
		Для Каждого КлючЗначение Из Значение Цикл
			ПроверитьСериализуемость(КлючЗначение.Значение);
		КонецЦикла;
		Возврат;
	КонецЕсли;

	Если ТипЗначения = Тип("Массив") Или ТипЗначения = Тип("ФиксированныйМассив") Тогда
		Для Каждого Элемент Из Значение Цикл
			ПроверитьСериализуемость(Элемент);
		КонецЦикла;
		Возврат;
	КонецЕсли;

	// Ссылки на объекты ИБ формально сериализуются в ХранилищеЗначения, но при
	// Получить() на другой базе/после реструктуризации возвращаются как
	// Неопределено: состояние loop молча теряется. Запрещаем явно: ссылки в
	// snapshot должны передаваться строкой (ПолучитьНавигационнуюСсылку),
	// см. RT-08, риск "ПроверитьСериализуемость не покрывает ссылочные типы".
	Если ЭтоСсылочныйТип(ИмяТипа(ТипЗначения)) Тогда
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'ar_AuditЗапуски.СохранитьСнимок: ссылка на объект ИБ в state недопустима: ""%1"". Передавайте ссылки строкой (ПолучитьНавигационнуюСсылку)';
				|en = 'ar_AuditЗапуски.СохранитьСнимок: infobase reference in state is not allowed: ""%1"". Pass references as a string (GetURL)'"),
			ИмяТипа(ТипЗначения));
	КонецЕсли;

	ВызватьИсключение СтрШаблон(
		НСтр("ru = 'ar_AuditЗапуски.СохранитьСнимок: недопустимый тип в state: ""%1""';
			|en = 'ar_AuditЗапуски.СохранитьСнимок: disallowed type in state: ""%1""'"),
		ИмяТипа(ТипЗначения));

КонецПроцедуры

// Строковое имя типа (для сообщений об ошибке и анализа ссылочности).
//
Функция ИмяТипа(ТипЗначения)
	Возврат Строка(ТипЗначения);
КонецФункции

// Признак того, что имя типа соответствует ссылке на объект ИБ
// (СправочникСсылка.*, ДокументСсылка.*, ПеречислениеСсылка.*, БизнесПроцессСсылка.*,
// ЗадачаСсылка.*, ПланВидовХарактеристикСсылка.*, ПланСчетовСсылка.*,
// ПланОбменаСсылка.*, ПланВидовРасчетаСсылка.*) либо ключу записи регистра.
// Проверяется по точному суффиксу слова до первой точки, чтобы исключить
// ложные срабатывания на бизнес-именах вроде "СсылкиНаДокументы".
//
Функция ЭтоСсылочныйТип(ИмяТипа)

	// Все ссылочные типы и ключи записи имеют вид "Префикс.Имя" (с точкой),
	// например "СправочникСсылка.Контрагенты". Отсутствие точки исключает
	// ложные срабатывания на примитивах и бизнес-именах.
	ПозицияТочки = СтрНайти(ИмяТипа, ".");
	Если ПозицияТочки = 0 Тогда
		Возврат Ложь;
	КонецЕсли;

	ЧастьДоТочки = Лев(ИмяТипа, ПозицияТочки - 1);
	Возврат ПравоеЗначениеСовпадает(ЧастьДоТочки, "Ссылка")
		Или ПравоеЗначениеСовпадает(ЧастьДоТочки, "КлючЗаписи");

КонецФункции

// Истина, если Строка заканчивается на Окончание.
//
Функция ПравоеЗначениеСовпадает(Строка, Окончание)
	Если СтрДлина(Строка) < СтрДлина(Окончание) Тогда
		Возврат Ложь;
	КонецЕсли;
	Возврат Прав(Строка, СтрДлина(Окончание)) = Окончание;
КонецФункции

#КонецОбласти
